zenes/esp32s3-TAS/examples/eth2ap/eth2ap.ino
void refreshLine() {
  // Move cursor to beginning of line (using \r)
  Serial.print("\r> ");
  // Print current inputString
  Serial.print(inputString);
  // Clear any leftover characters from previous longer string
  Serial.print("\033[K"); 
  // Move cursor back to current cursor_pos
  if (cursor_pos < inputString.length()) {
    Serial.printf("\033[%dD", (int)(inputString.length() - cursor_pos));
  }
}

void installHooks() {
  esp_netif_t* eth_netif = ETH.netif();
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  esp_netif_t* ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
#else
  esp_netif_t* ap_netif = WiFi.AP.netif();
#endif

  if (eth_netif && orig_eth_input == NULL) {
    struct netif* lwip_eth = (struct netif*)esp_netif_get_netif_impl(eth_netif);
    if (lwip_eth) {
      orig_eth_input = lwip_eth->input;
      orig_eth_linkoutput = lwip_eth->linkoutput;
      lwip_eth->input = eth_input_hook;
      lwip_eth->linkoutput = eth_linkoutput_hook;
      logMsg(LOG_INFO, "ETH Hooks installed (Handle: %p, netif: %p)", eth_netif, lwip_eth);
    }
  }

  if (ap_netif && orig_ap_input == NULL) {
    struct netif* lwip_ap = (struct netif*)esp_netif_get_netif_impl(ap_netif);
    if (lwip_ap) {
      orig_ap_input = lwip_ap->input;
      orig_ap_linkoutput = lwip_ap->linkoutput;
      lwip_ap->input = ap_input_hook;
      lwip_ap->linkoutput = ap_linkoutput_hook;
      logMsg(LOG_INFO, "AP Hooks installed (Handle: %p, netif: %p)", ap_netif, lwip_ap);
    }
  }
}

// Command List for Autocomplete
const char* shell_commands[] = {
  "help", "status", "dmesg", "loglevel", "monitor", "restart", "set_ssid", "set_pw", "stats", "traffic", "ping", "ifconfig", "arp", "dhcp", "iperf", "udp_iperf", "toe_iperf"
};
const int shell_cmd_count = sizeof(shell_commands) / sizeof(shell_commands[0]);

// Shell History
#define MAX_HISTORY 10
static String shell_history[MAX_HISTORY];
static int history_count = 0;
static int history_index = -1;

// Autocomplete Cycling
static int tab_match_index = -1;
static String tab_prefix = "";

// ANSI Sequence Parser State
static enum { ANSI_NONE, ANSI_ESC, ANSI_BRACKET } ansi_state = ANSI_NONE;

TFT_eSPI tft = TFT_eSPI(); // Invoke custom library
#define ENABLE_LCD // Enable logic, but will be checked dynamically
static bool lcd_initialized = false;
static bool lcd_detected = false;

/* LVGL Buffer (Double buffering for DMA) */
static lv_disp_draw_buf_t draw_buf;
static lv_color_t buf1[LCD_WIDTH * 160];
static lv_color_t buf2[LCD_WIDTH * 160];

/* UI Objects */
static lv_obj_t *ui_label_eth;
static lv_obj_t *ui_label_ap;
static lv_obj_t *ui_label_clients;
static lv_obj_t *ui_label_fps;
static lv_obj_t *ui_test_rect;
static uint32_t frame_cnt = 0;
static uint32_t fps_val = 0;

/* Timer callback to force Full Screen UI changes */
void move_test_rect_cb(lv_timer_t * t) {
  static uint8_t c = 0;
  c += 10;
  lv_obj_set_style_bg_color(lv_scr_act(), lv_color_make(c, 100, 200), 0);
}

/* Display flushing callback */
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p) {
  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);

  // Non-blocking DMA push
  tft.pushImageDMA(area->x1, area->y1, w, h, (uint16_t *)&color_p->full);
  
  lv_disp_flush_ready(disp); // Inform LVGL that it can start rendering to the OTHER buffer
}

// Network state
// ============================================================================
// Network Configuration (Static IP)
// Set USE_STATIC_IP to true if you want to use a static IP address.
// This is useful if DHCP is not available or slow (Example: Corporate Network).
// ============================================================================
#define USE_STATIC_IP true // Set to true to enable Static IP

#if USE_STATIC_IP
// Please change these values to match your network environment
IPAddress local_ip(192, 168, 0, 50);
IPAddress gateway(192, 168, 0, 100); // Set gateway to Device A (Direct Connect)
IPAddress subnet(255, 255, 255, 0);
IPAddress dns1(8, 8, 8, 8);
IPAddress dns2(8, 8, 4, 4);
#endif

// Network state
static bool eth_connected = false;
static bool ap_started = false;

/**
 * @brief Dynamic LCD hardware detection
 * @return true if LCD is detected, false otherwise
 */
bool detectLCD() {
  Serial.print("Probing LCD hardware... ");
  
  // Use SPI2 (FSPI) to avoid conflict with Ethernet (SPI3)
  static SPIClass* spi_p = nullptr;
  if (!spi_p) spi_p = new SPIClass(FSPI); 
  spi_p->begin(LCD_SCLK_PIN, LCD_MISO_PIN, LCD_MOSI_PIN, LCD_CS_PIN);
  
  pinMode(LCD_MISO_PIN, INPUT_PULLUP);
  pinMode(LCD_CS_PIN, OUTPUT);
  pinMode(LCD_DC_PIN, OUTPUT);
  pinMode(LCD_RST_PIN, OUTPUT);

  // Hardware Reset
  digitalWrite(LCD_RST_PIN, LOW);
  delay(100); 
  digitalWrite(LCD_RST_PIN, HIGH);
  delay(200); 
  
  digitalWrite(LCD_CS_PIN, LOW);
  delay(5); 
  
  spi_p->beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  
  // Multiple ID probe (ST7789 requires 1-byte dummy before parameter)
  auto readID = [&](uint8_t cmd) {
    digitalWrite(LCD_DC_PIN, LOW); spi_p->transfer(cmd);
    digitalWrite(LCD_DC_PIN, HIGH);
    spi_p->transfer(0x00); // Dummy Byte
    return spi_p->transfer(0x00); // Real ID
  };

  uint8_t id1 = readID(0xDA);
  uint8_t id2 = readID(0xDB);
  uint8_t id3 = readID(0xDC);
  
  spi_p->endTransaction();
  digitalWrite(LCD_CS_PIN, HIGH);
  
  bool detected = (id1 != 0x00 && id1 != 0xFF) || (id2 != 0x00 && id2 != 0xFF) || (id3 != 0x00 && id3 != 0xFF);

  if (detected) {
    Serial.printf("Done. LCD Detected (ID:%02X%02X%02X)\n", id1, id2, id3);
  } else {
    Serial.println("Failed. LCD not found.");
  }
  
  return detected;
}

/**
 * @brief Initialize LVGL UI widgets
 */
void initLVGLUI() {
  lv_obj_t *scr = lv_scr_act();
  lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

  /* Title */
  lv_obj_t *title = lv_label_create(scr);
  lv_label_set_text(title, "ETH2AP Bridge");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(title, lv_palette_main(LV_PALETTE_YELLOW), 0);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 10);

  /* FPS Label */
  ui_label_fps = lv_label_create(scr);
  lv_obj_set_style_text_font(ui_label_fps, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(ui_label_fps, lv_palette_main(LV_PALETTE_CYAN), 0);
  lv_obj_align(ui_label_fps, LV_ALIGN_TOP_RIGHT, -10, 10);
  lv_label_set_text(ui_label_fps, "FPS: 0");

  /* Color Test Boxes (Bottom) */
  static lv_color_t test_colors[] = {LV_COLOR_MAKE(255,0,0), LV_COLOR_MAKE(0,255,0), LV_COLOR_MAKE(0,0,255), LV_COLOR_MAKE(255,255,255), LV_COLOR_MAKE(0,0,0)};
  const char* color_names[] = {"R", "G", "B", "W", "K"};
  
  for(int i=0; i<5; i++) {
    lv_obj_t *box = lv_obj_create(scr);
    lv_obj_set_size(box, 30, 20);
    lv_obj_set_style_bg_color(box, test_colors[i], 0);
    lv_obj_set_style_border_width(box, 1, 0);
    lv_obj_set_style_border_color(box, lv_palette_main(LV_PALETTE_GREY), 0);
    lv_obj_align(box, LV_ALIGN_BOTTOM_LEFT, 10 + (i * 35), -10);
    
    lv_obj_t *lbl = lv_label_create(box);
    lv_label_set_text(lbl, color_names[i]);
    lv_obj_center(lbl);
    if(i == 3) lv_obj_set_style_text_color(lbl, lv_color_black(), 0); // Black text for White box
    else lv_obj_set_style_text_color(lbl, lv_color_white(), 0);
  }

  /* Separator */
  static lv_point_t line_points[] = {{0, 0}, {LCD_HEIGHT, 0}}; // Landscape orientation
  lv_obj_t *line = lv_line_create(scr);
  lv_line_set_points(line, line_points, 2);
  lv_obj_set_style_line_color(line, lv_palette_main(LV_PALETTE_GREY), 0);
  lv_obj_set_style_line_width(line, 2, 0);
  lv_obj_align(line, LV_ALIGN_TOP_MID, 0, 35);

  /* Ethernet Label */
  ui_label_eth = lv_label_create(scr);
  lv_label_set_recolor(ui_label_eth, true);
  lv_obj_set_style_text_color(ui_label_eth, lv_color_white(), 0);
  lv_obj_align(ui_label_eth, LV_ALIGN_TOP_LEFT, 10, 50);

  /* Access Point Label */
  ui_label_ap = lv_label_create(scr);
  lv_label_set_recolor(ui_label_ap, true);
  lv_obj_set_style_text_color(ui_label_ap, lv_color_white(), 0);
  lv_obj_align(ui_label_ap, LV_ALIGN_TOP_LEFT, 10, 80);

  /* Clients Info */
  ui_label_clients = lv_label_create(scr);
  lv_obj_set_style_text_color(ui_label_clients, lv_palette_lighten(LV_PALETTE_GREY, 1), 0);
  lv_obj_align(ui_label_clients, LV_ALIGN_TOP_LEFT, 10, 110);

  /* Animation Bar for FPS Verification */
  lv_obj_t *bar = lv_bar_create(scr);
  lv_obj_set_size(bar, 100, 5);
  lv_obj_align(bar, LV_ALIGN_BOTTOM_MID, 0, -40);
  lv_bar_set_range(bar, 0, 100);
  
