zenes/esp32s3-TAS/examples/eth2ap/eth2ap.ino
  lv_anim_t a;
  lv_anim_init(&a);
  lv_anim_set_var(&a, bar);
  lv_anim_set_values(&a, 0, 100);
  lv_anim_set_time(&a, 1000);
  lv_anim_set_playback_time(&a, 1000);
  lv_anim_set_repeat_count(&a, LV_ANIM_REPEAT_INFINITE);
  lv_anim_set_exec_cb(&a, (lv_anim_exec_xcb_t)lv_bar_set_value);
  lv_anim_start(&a);

  /* 30FPS Test Moving Rect */
  ui_test_rect = lv_obj_create(scr);
  lv_obj_set_size(ui_test_rect, 15, 15);
  lv_obj_set_style_bg_color(ui_test_rect, lv_palette_main(LV_PALETTE_YELLOW), 0);
  lv_obj_set_style_border_width(ui_test_rect, 0, 0);
  lv_obj_align(ui_test_rect, LV_ALIGN_CENTER, 0, 50);
  
  // Create 30Hz timer (1000/30 = 33.3ms)
  lv_timer_create(move_test_rect_cb, 33, NULL);
}

/**
 * @brief Update LCD with current network status (LVGL version)
 */
void updateLCD() {
#ifdef ENABLE_LCD
  if (!lcd_initialized) {
    return;
  }

  // Update Ethernet Status Label
  if (eth_connected) {
    char buf_eth[64];
    snprintf(buf_eth, sizeof(buf_eth), "ETH: #00FF00 Connected#\n IP: %s", ETH.localIP().toString().c_str());
    lv_label_set_text(ui_label_eth, buf_eth);
  } else {
    lv_label_set_text(ui_label_eth, "ETH: #FF0000 Disconnected#");
  }

  // Update AP Status Label
  if (ap_started) {
    char buf_ap[64];
    snprintf(buf_ap, sizeof(buf_ap), "AP: #00FF00 Running#\n SSID: %s", ap_ssid_custom.c_str());
    lv_label_set_text(ui_label_ap, buf_ap);

    char buf_clients[32];
    snprintf(buf_clients, sizeof(buf_clients), "Clients: %d / %d", WiFi.softAPgetStationNum(), AP_MAX_CONN);
    lv_label_set_text(ui_label_clients, buf_clients);
  } else {
    lv_label_set_text(ui_label_ap, "AP: #FF0000 Stopped#");
    lv_label_set_text(ui_label_clients, "");
  }
#endif
}

/**
 * @brief Handle Serial Shell Commands
 */
void handleShell() {
  while (Serial.available()) {
    char inChar = (char)Serial.read();

    // ANSI Escape Sequence Parser
    if (ansi_state == ANSI_NONE) {
      if (inChar == 0x1B) { // ESC
        ansi_state = ANSI_ESC;
        continue;
      }
    } else if (ansi_state == ANSI_ESC) {
      if (inChar == '[') {
        ansi_state = ANSI_BRACKET;
      } else {
        ansi_state = ANSI_NONE;
      }
      continue;
    } else if (ansi_state == ANSI_BRACKET) {
      ansi_state = ANSI_NONE;
      if (inChar == 'A') { // UP Arrow
        if (history_count > 0) {
          if (history_index == -1) history_index = history_count - 1;
          else if (history_index > 0) history_index--;
          
          inputString = shell_history[history_index];
          cursor_pos = inputString.length();
          refreshLine();
        }
        continue;
      }
      else if (inChar == 'B') { // DOWN Arrow
        if (history_count > 0 && history_index != -1) {
          history_index++;
          if (history_index >= history_count) {
            history_index = -1;
            inputString = "";
          } else {
            inputString = shell_history[history_index];
          }
          cursor_pos = inputString.length();
          refreshLine();
        }
        continue;
      }
      else if (inChar == 'C') { // RIGHT Arrow
        if (cursor_pos < inputString.length()) {
          cursor_pos++;
          Serial.print("\033[C"); // ANSI Right
        }
        continue;
      }
      else if (inChar == 'D') { // LEFT Arrow
        if (cursor_pos > 0) {
          cursor_pos--;
          Serial.print("\033[D"); // ANSI Left
        }
        continue;
      }
      continue;
    }
    
    // Ctrl+C (Cancel)
    if (inChar == 0x03) {
      if (ping_running) {
        ping_running = false;
        Serial.print("^C\r\nStopping ping.\r\n> ");
      } else {
        Serial.print("^C\r\n> ");
      }
      inputString = "";
      cursor_pos = 0;
      history_index = -1;
      tab_match_index = -1;
      tab_prefix = "";
      continue;
    }

    // Reset Tab Cycling if anything else is pressed
    if (inChar != 0x09) {
      tab_match_index = -1;
      tab_prefix = "";
    }

    // Echo back the character
    if (inChar == '\n' || inChar == '\r') {
      Serial.print("\r\n"); // New line on enter
      if (inputString.length() > 0) {
        // Save to history
        if (history_count == 0 || shell_history[history_count-1] != inputString) {
          if (history_count < MAX_HISTORY) {
            shell_history[history_count++] = inputString;
          } else {
            for (int i = 0; i < MAX_HISTORY - 1; i++) shell_history[i] = shell_history[i+1];
            shell_history[MAX_HISTORY-1] = inputString;
          }
        }
        history_index = -1;
        cursor_pos = 0; // Reset for next command
        stringComplete = true;
      } else {
        Serial.print("> "); // Empty line, just show prompt
        cursor_pos = 0;
      }
    } 
    else if (inChar == 0x09) { // Tab key
      if (inputString.length() > 0) {
        // First tab or cycling?
        if (tab_match_index == -1) {
          tab_prefix = inputString;
          tab_match_index = 0;
        } else {
          tab_match_index++;
        }

        String matches[shell_cmd_count];
        int matchCount = 0;
        for (int i = 0; i < shell_cmd_count; i++) {
          if (String(shell_commands[i]).startsWith(tab_prefix)) {
            matches[matchCount++] = shell_commands[i];
          }
        }

        if (matchCount > 0) {
          if (tab_match_index >= matchCount) tab_match_index = 0;
          
          inputString = matches[tab_match_index];
          cursor_pos = inputString.length();
          refreshLine();
        }
      }
    }
    else if (inChar == 0x08 || inChar == 0x7F) { // Backspace or Delete
      if (cursor_pos > 0) {
        inputString.remove(cursor_pos - 1, 1);
        cursor_pos--;
        refreshLine();
      }
    }
    else {
      // Insert character at cursor_pos
      if (cursor_pos == inputString.length()) {
        inputString += inChar;
        cursor_pos++;
        Serial.print(inChar); // Normal echo
      } else {
        String start = inputString.substring(0, cursor_pos);
        String end = inputString.substring(cursor_pos);
        inputString = start + inChar + end;
        cursor_pos++;
        refreshLine();
      }
    }
  }

  if (stringComplete) {
    inputString.trim();
    // Handled in handleShell loop already

