zenes/esp32s3-TAS/examples/eth2ap/eth2ap.ino
      Serial.println("[WiFi AP]");
      Serial.printf("  RX: %s (%lu pkts)\r\n", formatBytes(ap_stats.rx_bytes).c_str(), ap_stats.rx_packets);
      Serial.printf("  TX: %s (%lu pkts)\r\n", formatBytes(ap_stats.tx_bytes).c_str(), ap_stats.tx_packets);
      
      Serial.println("-----------------------------------\r\n");
    }
#endif
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("traffic")) {
      if (arg.equalsIgnoreCase("on")) {
        traffic_log_enabled = true;
        installHooks(); // Ensure hooks are on
        Serial.println("Real-time traffic logging: ON");
      } else if (arg.equalsIgnoreCase("off")) {
        traffic_log_enabled = false;
        Serial.println("Real-time traffic logging: OFF");
      } else {
        Serial.println("\r\n--- Connected Stations ---");
        wifi_sta_list_t stationList;
        esp_wifi_ap_get_sta_list(&stationList);
        for (int i = 0; i < stationList.num; i++) {
          char macStr[18];
          snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
                   stationList.sta[i].mac[0], stationList.sta[i].mac[1], stationList.sta[i].mac[2],
                   stationList.sta[i].mac[3], stationList.sta[i].mac[4], stationList.sta[i].mac[5]);
          Serial.printf("  [%d] MAC: %s, RSSI: %d\r\n", i+1, macStr, stationList.sta[i].rssi);
        }
        Serial.println("--------------------------\r\n");
      }
    }
#endif
    else if (cmd.equalsIgnoreCase("ping")) {
      if (arg.length() > 0) {
        ping_target = arg;
        ping_running = true;
        last_ping_time = 0; // Start immediately
        Serial.printf("Pinging %s (Infinite, press Ctrl+C to stop)...\r\n", ping_target.c_str());
      } else {
        Serial.print("Usage: ping <host>\r\n");
      }
    }
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("ifconfig") || cmd.equalsIgnoreCase("ip")) {
      Serial.print("\r\n--- Interface Configuration ---\r\n");
      Serial.println("[ETH] Ethernet Interface:");
      Serial.printf("  Status: %s\r\n", eth_connected ? "UP" : "DOWN");
      if (eth_connected) {
        Serial.printf("  MAC   : %s\r\n", ETH.macAddress().c_str());
        Serial.printf("  IPv4  : %s\r\n", ETH.localIP().toString().c_str());
        Serial.printf("  Subnet: %s\r\n", ETH.subnetMask().toString().c_str());
        Serial.printf("  GW    : %s\r\n", ETH.gatewayIP().toString().c_str());
        Serial.printf("  DNS   : %s\r\n", ETH.dnsIP().toString().c_str());
      }
      
      Serial.println("\r\n[AP] WiFi Access Point:");
      Serial.printf("  Status: %s\r\n", ap_started ? "UP" : "DOWN");
      if (ap_started) {
        Serial.printf("  MAC   : %s\r\n", WiFi.softAPmacAddress().c_str());
        Serial.printf("  IPv4  : %s\r\n", WiFi.softAPIP().toString().c_str());
      }
      Serial.print("-------------------------------\r\n");
    }
#endif
    else if (cmd.equalsIgnoreCase("arp")) {
      Serial.print("\r\n--- AP ARP / Station List ---\r\n");
      wifi_sta_list_t stationList;
      esp_wifi_ap_get_sta_list(&stationList);
      if (stationList.num == 0) {
        Serial.println("  No clients connected.");
      } else {
        for (int i = 0; i < stationList.num; i++) {
          char macStr[18];
          snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
                   stationList.sta[i].mac[0], stationList.sta[i].mac[1], stationList.sta[i].mac[2],
                   stationList.sta[i].mac[3], stationList.sta[i].mac[4], stationList.sta[i].mac[5]);
          Serial.printf("  [%d] MAC: %s, RSSI: %d\r\n", i+1, macStr, stationList.sta[i].rssi);
        }
      }
      Serial.print("-----------------------------\r\n");
    }
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("dhcp")) {
      Serial.print("\r\n--- AP DHCP Leases ---\r\n");
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      esp_netif_t* ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
#else
      esp_netif_t* ap_netif = WiFi.AP.netif();
#endif
      wifi_sta_list_t stationList;
      esp_wifi_ap_get_sta_list(&stationList);

      if (ap_netif && stationList.num > 0) {
        esp_netif_pair_mac_ip_t mac_ip_pair[10]; 
        int num_clients = stationList.num > 10 ? 10 : stationList.num;
        
        // Prepare MAC addresses as input
        for (int i = 0; i < num_clients; i++) {
            memcpy(mac_ip_pair[i].mac, stationList.sta[i].mac, 6);
            mac_ip_pair[i].ip.addr = 0; // Clear IP initially
        }

        // ESP_OK (0) means success
        if (esp_netif_dhcps_get_clients_by_mac(ap_netif, num_clients, mac_ip_pair) == ESP_OK) {
          int count = 0;
          for (int i = 0; i < num_clients; i++) {
            if (mac_ip_pair[i].ip.addr != 0) {
              char macStr[18];
              snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
                       mac_ip_pair[i].mac[0], mac_ip_pair[i].mac[1], mac_ip_pair[i].mac[2],
                       mac_ip_pair[i].mac[3], mac_ip_pair[i].mac[4], mac_ip_pair[i].mac[5]);
                       
              char ipStr[16];
              ip4addr_ntoa_r((const ip4_addr_t*)&mac_ip_pair[i].ip, ipStr, sizeof(ipStr));

              Serial.printf("  [%d] MAC: %s  ->  IP: %s\r\n", count+1, macStr, ipStr);
              count++;
            }
          }
          if (count == 0) {
             Serial.println("  No active DHCP leases with IP assigned.");
          }
        } else {
          Serial.println("  Failed to query DHCP server.");
        }
      } else {
        Serial.println("  No active DHCP leases (or AP down).");
      }
      Serial.print("----------------------\r\n");
    }
#endif
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("iperf")) {
      if (arg.equalsIgnoreCase("start")) {
        if (lwiperf_session != NULL) {
           Serial.println("iPerf server is already running on port 5001.");
        } else {
           lwiperf_session = lwiperf_start_tcp_server_default(lwiperf_report, NULL);
           if (lwiperf_session != NULL) {
               Serial.println("iPerf TCP server started (Port 5001). Connect with: iperf -c <IP> -i 1 -t 10");
           } else {
               Serial.println("Failed to start iPerf TCP server.");
           }
        }
      } else if (arg.equalsIgnoreCase("stop")) {
        if (lwiperf_session != NULL) {
           lwiperf_abort(lwiperf_session);
           lwiperf_session = NULL;
           Serial.println("iPerf server stopped.");
        } else {
           Serial.println("iPerf server is not running.");
        }
      } else {
        Serial.println("Usage: iperf <start|stop>");
      }
    }
#endif
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("toe_iperf")) {
      if (arg.startsWith("start")) {
        if(toe_iperf_is_running()) {
            Serial.println("[TOE-iPerf] Already running. Please stop first.");
            return;
        }
        
        // Cache lwIP settings for TOE hardware to use before tearing down ETH
        toe_iperf_cfg_t cfg;
        cfg.port = 5003; // Default port
        cfg.is_server = true;
        cfg.local_ip = ETH.localIP();
        cfg.gateway = ETH.gatewayIP();
        cfg.subnet = ETH.subnetMask();
        esp_read_mac(cfg.mac_addr, ESP_MAC_ETH);
        
        cfg.is_udp = false;
        if (arg.indexOf("-u") != -1) {
             cfg.is_udp = true;
             arg.replace("-u", "");
             arg.trim();
        }
        
        Serial.printf("[TOE-iPerf] Shutting down ESP_ETH (lwIP) for HW %s test...\n", cfg.is_udp ? "UDP" : "TCP");
        ETH.end(); // Stop conflicting driver and release SPI bus
        
        int dash_idx = arg.indexOf('-');
        if (dash_idx != -1 && arg.length() > dash_idx + 1) {
            char mode = arg.charAt(dash_idx + 1);
            if (mode == 's') {
                cfg.is_server = true;
                if(toe_iperf_start(&cfg)) {
                    Serial.println("[TOE-iPerf] Hardware Server Test Started.");
                } else {
                    Serial.println("[TOE-iPerf] Already running.");
                }
            } else if (mode == 'c') {
                cfg.is_server = false;
                String ip_str = arg.substring(dash_idx + 3);
                ip_str.trim();
                cfg.target_ip = ip_str.c_str(); // Memory safety for arg lifetime? 
                if(toe_iperf_start(&cfg)) {
                    Serial.printf("[TOE-iPerf] Hardware Client Test Started to %s.\r\n", cfg.target_ip);
                } else {
                    Serial.println("[TOE-iPerf] Already running.");
                }
            } else {
             }
        } else {
             // Default to server if no args
             if(toe_iperf_start(&cfg)) {
                 Serial.println("[TOE-iPerf] Hardware Server Test Started (Default).");
             } else {
                 Serial.println("[TOE-iPerf] Already running.");
                 // Restart ETH if failed
                 ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN, SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 40);
             }
        }
      } else if (arg.equalsIgnoreCase("stop")) {
        if (!toe_iperf_is_running()) {
            Serial.println("[TOE-iPerf] Hardware Test is not running.");
            return;
        }
        toe_iperf_stop();
        Serial.println("[TOE-iPerf] Hardware Test Stopped. Restoring ESP_ETH...");
        // Restart the ESP-IDF driver to restore NAT operation
        ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN, SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 40);
        
