zenes/esp32s3-TAS/examples/eth2ap/eth2ap.ino
#if USE_STATIC_IP
        ETH.config(local_ip, gateway, subnet, dns1, dns2);
#endif
        Serial.println("[TOE-iPerf] Internet sharing features resumed.");
      } else {
        Serial.println("Usage: toe_iperf <start|stop> [-s | -c ip_address]");
      }
    }
#endif
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("bridge")) {
      if (arg.startsWith("start")) {
        if(socket_bridge_is_running() || toe_iperf_is_running()) {
            Serial.println("Another TOE task is already running.");
            return;
        }
        
        int listen_port = 5003; 
        String target_ip = "192.168.0.100";
        int target_port = 5003;
        
        // Find first space after "start"
        int space1 = arg.indexOf(' ');
        if (space1 != -1) {
            int space2 = arg.indexOf(' ', space1 + 1);
            if (space2 != -1) {
                listen_port = arg.substring(space1 + 1, space2).toInt();
                int space3 = arg.indexOf(' ', space2 + 1);
                if (space3 != -1) {
                    target_ip = arg.substring(space2 + 1, space3);
                    target_port = arg.substring(space3 + 1).toInt();
                } else {
                    target_ip = arg.substring(space2 + 1);
                }
            }
        }

        socket_bridge_cfg_t cfg;
        cfg.listen_port = listen_port;
        
        IPAddress target_ip_addr;
        if (target_ip_addr.fromString(target_ip)) {
            for(int i=0; i<4; i++) cfg.target_ip[i] = target_ip_addr[i];
        } else {
            // Default if parsing fails
            cfg.target_ip[0] = 192; cfg.target_ip[1] = 168; cfg.target_ip[2] = 0; cfg.target_ip[3] = 100;
        }
        
        cfg.target_port = target_port;
        cfg.local_ip = ETH.localIP();
        cfg.gateway = ETH.gatewayIP();
        cfg.subnet = ETH.subnetMask();
        esp_read_mac(cfg.mac_addr, ESP_MAC_ETH);
        cfg.is_udp = false;

        Serial.printf("[Bridge] Connecting WiFi:%d <-> Ethernet:%s:%d\n", listen_port, cfg.target_ip, cfg.target_port);
        ETH.end(); 

        if(socket_bridge_start(&cfg)) {
            Serial.println("[Bridge] Started.");
        } else {
            Serial.println("[Bridge] Failed.");
            ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN, SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 40);
        }
      } else if (arg.equalsIgnoreCase("stop")) {
        socket_bridge_stop();
        Serial.println("[Bridge] Stopped.");
        delay(500);
        ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN, SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 40);
      } else {
        Serial.println("Usage: bridge start <listen_port> <target_ip> <target_port>");
        Serial.println("       bridge stop");
      }
    }
#endif
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("udp_iperf")) {
      if (arg.equalsIgnoreCase("start")) {
        if (udp_iperf_running) {
           Serial.println("UDP iPerf server is already running on port 5002.");
        } else {
           if (udp_iperf_server.listen(5002)) {
               udp_iperf_server.onPacket(onUDPPacket);
               udp_iperf_running = true;
               udp_iperf_bytes = 0;
               udp_iperf_last_print = millis();
               Serial.println("UDP Test server started on Port 5002.");
               Serial.println("Connect with: iperf -c <IP> -u -p 5002 -b 20M -i 1 -t 10");
           } else {
               Serial.println("Failed to start UDP Test server.");
           }
        }
      } else if (arg.equalsIgnoreCase("stop")) {
        if (udp_iperf_running) {
           udp_iperf_server.close();
           udp_iperf_running = false;
           Serial.println("UDP Test server stopped.");
        } else {
           Serial.println("UDP Test server is not running.");
        }
      } else {
        Serial.println("Usage: udp_iperf <start|stop>");
      }
    }
#endif
    else {
      Serial.printf("Unknown command: %s. Type 'help' for list.\r\n", cmd.c_str());
    }

    inputString = "";
    stringComplete = false;
    Serial.print("> "); // Prompt for next command
  }
}

/**
 * @brief WiFi and Ethernet event handler
 *
 * Handles connection events for both Ethernet and WiFi AP interfaces.
 * When Ethernet gets an IP, starts the WiFi AP and enables NAPT for packet
 * forwarding.
 */
void NetworkEvent(arduino_event_id_t event) {
  switch (event) {
#ifdef ENABLE_ETHERNET
  case ARDUINO_EVENT_ETH_START:
    logMsg(LOG_INFO, "ETH Started");
    ETH.setHostname("eth2ap-bridge");
    installHooks(); // Try installing hooks on start
    break;

  case ARDUINO_EVENT_ETH_CONNECTED:
    logMsg(LOG_INFO, "ETH Connected");
    installHooks(); // Re-verify hooks on connection
    break;

  case ARDUINO_EVENT_ETH_GOT_IP:
    logMsg(LOG_INFO, "ETH MAC: %s, IPv4: %s, %s, %d Mbps", 
           ETH.macAddress().c_str(), ETH.localIP().toString().c_str(),
           ETH.fullDuplex() ? "FULL_DUPLEX" : "HALF_DUPLEX", ETH.linkSpeed());
    eth_connected = true;

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    if (WiFi.AP.enableNAPT(true)) {
      logMsg(LOG_INFO, "NAPT enabled - Bridge is active");
    } else {
      logMsg(LOG_ERROR, "NAPT enable failed!");
    }
#endif
    break;

  case ARDUINO_EVENT_ETH_DISCONNECTED:
    logMsg(LOG_WARN, "ETH Disconnected");
    eth_connected = false;
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    WiFi.AP.enableNAPT(false);
#endif
    break;

  case ARDUINO_EVENT_ETH_STOP:
    logMsg(LOG_INFO, "ETH Stopped");
    eth_connected = false;
    break;
#endif

  case ARDUINO_EVENT_WIFI_AP_START:
    logMsg(LOG_INFO, "WiFi AP Started (SSID: %s, IP: %s)", ap_ssid_custom.c_str(), WiFi.softAPIP().toString().c_str());
    ap_started = true;
    break;

  case ARDUINO_EVENT_WIFI_AP_STOP:
    logMsg(LOG_INFO, "WiFi AP Stopped");
    ap_started = false;
    break;

  case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
    logMsg(LOG_INFO, "WiFi AP: Station connected");
    break;

  case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
    logMsg(LOG_INFO, "WiFi AP: Station disconnected");
    break;

  default:
    break;
  }
  // Update LCD on any major network event
  updateLCD();
}

void setup() {
  Serial.begin(115200);
  delay(1000); // Wait for Serial to stabilize

  esp_reset_reason_t reason = esp_reset_reason();
  Serial.printf("\n\n[System] Reset Reason: %d\n", reason);

  Serial.println("===== eth2ap Bridge Example =====");
  Serial.println("Ethernet to WiFi AP Bridge using NAPT");
  Serial.println("=====================================\n");
  Serial.print("> "); // Initial prompt

  // Step 0: Load saved settings from NVS
  preferences.begin("wifi-config", false); // Open in read-write mode to save if not exists
  if (!preferences.isKey("ssid")) {
    preferences.putString("ssid", ap_ssid_custom);
    preferences.putString("password", ap_pw_custom);
  } else {
    ap_ssid_custom = preferences.getString("ssid", AP_SSID_BASE);
    ap_pw_custom = preferences.getString("password", AP_PASSWORD_BASE);
  }
  preferences.end();
  logMsg(LOG_INFO, "Loaded settings: SSID='%s'", ap_ssid_custom.c_str());

  // Step 1: Start WiFi AP immediately (Always-On Priority)
  logMsg(LOG_INFO, "Step 1: Starting WiFi AP (softAP)... %s", 
    WiFi.softAP(ap_ssid_custom.c_str(), ap_pw_custom.c_str(), AP_CHANNEL, 0, AP_MAX_CONN) ? "Success" : "FAILED");

  esp_err_t err = esp_wifi_set_bandwidth(WIFI_IF_AP, WIFI_BW_HT40);
  logMsg(LOG_INFO, "Step 2: Setting WiFi Bandwidth to HT40... %s", (err == ESP_OK) ? "Success" : "FAILED");

  logMsg(LOG_INFO, "Step 3: Checking AP Status... SSID: %s, IP: %s", 
         ap_ssid_custom.c_str(), WiFi.softAPIP().toString().c_str());
  ap_started = true;

  // Step 4: Setting up WiFi events
  Serial.print("Step 4: Registering Network Events... ");
  WiFi.onEvent(NetworkEvent);
  Serial.println("Done.");

