zenes/esp32s3-TAS/examples/eth2ap/eth2ap.ino
  Serial.println("\n[Note] WiFi AP is running.");
  Serial.println("       Internet access will be available after Ethernet connection.\n");

  // Step 5: Initialize LCD (Dynamically detected)
#ifdef ENABLE_LCD
  lcd_detected = detectLCD();
  if (lcd_detected) {
    Serial.print("Step 5: Initializing LCD Pins... ");
    pinMode(LCD_BL_PIN, OUTPUT);
    digitalWrite(LCD_BL_PIN, HIGH); // Turn on backlight
    Serial.println("Done.");

    Serial.print("Step 6: tft.init(), initDMA() and LVGL Setup... ");
    tft.init();
    tft.initDMA(); // Must be called after tft.init()
    
    /* Initialize LVGL */
    lv_init();
    lv_disp_draw_buf_init(&draw_buf, buf1, buf2, LCD_WIDTH * 160);

    /* Initialize the display driver for LVGL */
    static lv_disp_drv_t disp_drv;
    lv_disp_drv_init(&disp_drv);
    disp_drv.hor_res = LCD_HEIGHT; // Landscape
    disp_drv.ver_res = LCD_WIDTH;  // Landscape
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.draw_buf = &draw_buf;
    lv_disp_drv_register(&disp_drv);

    lcd_initialized = true; 
    Serial.println("Done.");

    Serial.print("Step 7: LVGL UI creation... ");
    tft.setRotation(1); // Landscape
    initLVGLUI();
    updateLCD();
    Serial.println("Done.");
  } else {
    Serial.println("Step 5-7: LCD Hardware not found. Skipping.");
  }
#else
  Serial.println("Step 5-7: LCD Feature Disabled.");
#endif

  // Step 8: Initialize Ethernet
#ifdef ENABLE_ETHERNET
  logMsg(LOG_INFO, "Step 8: Initializing Ethernet...");

#if CONFIG_IDF_TARGET_ESP32
  ETH.begin(ETH_TYPE, ETH_ADDR, ETH_MDC_PIN, ETH_MDIO_PIN, ETH_RESET_PIN, ETH_CLK_MODE);
#else
  ETH.begin(ETH_PHY_W5500, ETH_ADDR, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN,
            SPI3_HOST, ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN, 40);
#endif

#if USE_STATIC_IP
  ETH.config(local_ip, gateway, subnet, dns1, dns2);
#endif

  logMsg(LOG_INFO, "Ethernet initialization command sent");
  
  // Final Step: Install Hooks
  installHooks(); 
#else
  logMsg(LOG_WARN, "Step 8: Ethernet Feature Disabled (#define ENABLE_ETHERNET).");
#endif

  Serial.println("Waiting for Ethernet connection to enable internet sharing...");
  logMsg(LOG_INFO, "System ready. Type 'help' for commands.");
}

void loop() {
  // Print status every 5 seconds (Changed from 30 for debugging)
  static unsigned long lastStatusPrint = 0;
  unsigned long currentMillis = millis();

  if (currentMillis - lastStatusPrint >= 5000) {
    lastStatusPrint = currentMillis;

    if (monitor_enabled) {
      logMsg(LOG_INFO, "----- Status -----");
#ifdef ENABLE_ETHERNET
      logMsg(LOG_INFO, "Ethernet: %s", eth_connected ? "Connected" : "Disconnected");
      if (eth_connected) {
        logMsg(LOG_INFO, "  IP: %s", ETH.localIP().toString().c_str());
      }
#endif
      logMsg(LOG_INFO, "WiFi AP : %s", ap_started ? "Running" : "Stopped");
      if (ap_started) {
        logMsg(LOG_INFO, "  Clients: %d", WiFi.softAPgetStationNum());
      }
      logMsg(LOG_INFO, "------------------\r\n");
    }

#ifdef ENABLE_ETHERNET
    if (monitor_traffic) {
        unsigned long now = millis();
        if (now - last_speed_check >= 2000) {
          last_speed_check = now;
          Serial.printf("[Monitor] ETH RX: %s, TX: %s | AP RX: %s, TX: %s\r\n", 
                        formatBytes(eth_stats.rx_bytes).c_str(), formatBytes(eth_stats.tx_bytes).c_str(), 
                        formatBytes(ap_stats.rx_bytes).c_str(), formatBytes(ap_stats.tx_bytes).c_str());
        }
    }
#endif

    // Update LCD periodically
    updateLCD();
  }

  // Handle Serial Shell
  handleShell();

  // Handle UDP iPerf Reporting
#ifdef ENABLE_ETHERNET
  if (udp_iperf_running) {
    uint32_t now = millis();
    if (now - udp_iperf_last_print >= 1000) {
      // Calculate Mbps and MB/s
      float mbps = (udp_iperf_bytes * 8.0) / 1000000.0;
      float mb_s = udp_iperf_bytes / (1024.0 * 1024.0);
      
      Serial.printf("\r\n[UDP iPerf] %.2f MB/s  |  %.2f Mbps  (Received: %u Bytes)\r\n> ", mb_s, mbps, (unsigned int)udp_iperf_bytes);
      refreshLine();
      udp_iperf_bytes = 0; // Reset for next second
      udp_iperf_last_print = now;
    }
  }
#endif

  // Infinite Ping
  if (ping_running) {
    if (currentMillis - last_ping_time >= 1000) {
      last_ping_time = currentMillis;
      bool success = Ping.ping(ping_target.c_str(), 1);
      if (success) {
        Serial.printf("Reply from %s: time=%.2fms\r\n", ping_target.c_str(), Ping.averageTime());
      } else {
        Serial.printf("Request timeout for %s\r\n", ping_target.c_str());
      }
    }
  }

  // Update LVGL tick and timer handler
  lv_timer_handler();

  // Update FPS Label every 1 second independently
  static uint32_t last_fps_millis = 0;
  if (millis() - last_fps_millis >= 1000) {
    if (lcd_initialized && ui_label_fps) {
        fps_val = lv_refr_get_fps_avg(); // Use LVGL internal average FPS
        char buf_fps[16];
        snprintf(buf_fps, sizeof(buf_fps), "FPS: %u", fps_val);
        lv_label_set_text(ui_label_fps, buf_fps);
    }
    last_fps_millis = millis();
  }

  delay(5);
}
